#define _CRT_SECURE_NO_WARNINGS 1


#include <stdio.h>


//如何看待内存空间的视角
//int main()
//{
//	int a = 10;        
//	float f = 10.0;
//
//	return 0;
//	return 0;
//}







//void
//void test(void) //括号里面的void表示函数无参数 
//{
//	printf("hehe");
//}
//int main()
//{
//	test();
//	return 0;
//}








//原码 反码 补码   数据在内存中以补码的形式存放
//int main()
//{
//	int a = 20; 
//	//00000000 00000000 00000000 00010100 - 原码
//	//00000000 00000000 00000000 00010100 - 反码
//	//00000000 00000000 00000000 00010100 - 补码
//	//0x00 00 00 14
//	int b = -10;
//	//10000000 00000000 00000000 00001010 - 原码
//	//11111111 11111111 11111111 11110101 - 反码
//	//11111111 11111111 11111111 11110110 - 补码
//	//0xff ff ff f6
//	return 0;
//}







//写一段代码,告诉我们当前机器的字节序是什么?     小端字节序or大端字节序
//int check_sys()
//{
//	int a = 1;
//	char* p = (char*)&a;
//	/*if (*p == 1)
//		return 1;
//	else
//		return 0;*/
//	//返回1,小端 返回0,大端
//	return *p;
//}


//int check_sys()
//{
//	int a = 1;
//	return *(char*)&a;
//}
//int main()
//{
//	/*int a = 1;
//	char* p =(char*)&a;
//	if (*p == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端");
//	}*/
//	//返回1,小端
//	//返回2,大端
//	int ret=check_sys();
//	if (ret == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;	
//}








//int main()
//{
//	char a = -128;
//	//10000000 00000000 00000000 10000000
//	//11111111 11111111 11111111 01111111
//	//11111111 11111111 11111111 10000000
//	//10000000 - 补码
//	//11111111 11111111 11111111 10000000  - 整型提升之后的补码
//	//转化为无符号的十进制 - 4294967168	
//	printf("%u\n",a); 
//	//%d - 打印十进制的有符号数字
//	//%u - 打印十进制的无符号数字
//	return 0;
//}









//int main()
//{
//	int i = -20;
//	unsigned int j = 10;
//	printf("%d\n",i+j);
//}







//#include <windows.h>
//int main()   
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)    //一直循环
//	{
//		printf("%u\n",i);
//		Sleep(100);
//	}
//	return 0;
//}










//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d",strlen(a)); //255
//	return 0;
//}








//unsigned char i = 0;
//int main()
//{
//	for (i = 0; i <= 255; i++)  //死循环
//	{
//		printf("hello world\n");
//	}
//	return 0; 
//}










//浮点型在内存中的存储





//int main()
//{
//	double d = 1E10;  //1.0 * 10的十次方
//	printf("%lf\n",d);
//	return 0;
//}










//9.0
//1001.0 - 二进制形式
//(-1)^0 * 1.001 * 2^3
//(-1)^s * M     * 2^E
//S - 0  M - 1.001 E - 3
//
//0.5
//0.1 - 二进制形式
//(-1)^0 * 1.0 * 2^(-1)
//S=0 M=1.0 E=-1
//E=-1
//E+127=126

int main()
{
	int n = 9;                 //00000000000000000000000000001001 - 补码
	float* pFloat = (float*)&n;
	printf("n的值为:%d\n",n);
	printf("*pFloat的值为:%f\n",*pFloat); //0 0000000 000000000000000000001001   - 还原浮点数
	                                      //(-1)^0 * 0.000000000000000000001001 * 2^(1-127)     故打印0.000000
	*pFloat = 9.0; 
	//1001.0
	//(-1)^0 * 1.001 * 2^3
	//0 10000010 00100000000000000000000 - 内存空间存放的形式
		
	printf("num的值为:%d\n", n);  //01000001000100000000000000000000 - 1091567616
	printf("*pFloat的值为:%f\n", *pFloat);//9.0
	return 0;
}







//int main()
//{
//	float f = 5.5;
//	//5.5
//	//101.1 
//	//(-1)^0 * 1.011 * 2^2
//	//S=0  M=1.011  E=2
//	//0 10000001	01100000000000000000000
//    //0100 0000 1011 0000 0000 0000 0000 0000
//	//0x40b00000
//} 















